Repository: galgaloda/ethiopian_names_app
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: Ethiopian Names App
am: የኢትዮጵያ ስሞች መተግበሪያ

source: Translated From:
am: የሚተረጎመው ከ:

source: Translated To:
am: የሚተረጎመው ወደ:

# trySample
source: Try a sample:
am: ናሙና ይሞክሩ:

# suggestName
source: Suggest a Name
am: ስም ይጠቁሙ

source: Enter name...
am: ስም ያስገቡ...

source: Result...
am: መልስ...

# oromoName
source: Afaan Oromo (Qubee)
am: አፋን ኦሮሞ (ቁቤ)

# englishName
source: English
am: እንግሊዝኛ

# amharicName
source: Amharic (ፊደል)
am: አማርኛ (ፊደል)

# textCopied
source: Text copied to clipboard!
am: ጽሁፍ ወደ ቅንጥብ ሰሌዳ ተቀዳ!

source: Menu
am: ሜኑ

source: Home
am: መነሻ

source: Settings
am: ማስተካከያዎች

source: About
am: ስለ

# oromoNameLabel
source: Afaan Oromo Name
am: አፋን ኦሮሞ ስም

# englishNameLabel
source: English Name
am: እንግሊዝኛ ስም

# amharicNameLabel
source: Amharic (ፊደል) Name
am: አማርኛ (ፊደል) ስም

# pleaseEnterName
source: Please enter a name
am: ስም ያስገቡ

source: Cancel
am: ያቁሙ

source: Submit
am: ያስገቡ

source: Suggestion submitted!
am: ግልፅ ተላከ!

source: Send Feedback
am: አስተያየት ያስተላልፉ

# enterFeedback
source: Enter your feedback...
am: አስተያየትዎን ያስገቡ...

source: Feedback sent!
am: አስተያየት ተላከ!

# errorOccurred
source: An error occurred.
am: ስህተት ተፈጥሮአል።

# aboutDescription
source: This app helps to accurately transliterate names between Afan Oromo (Qubee), English, and Amharic (ፊደል). It uses a 'database-first' approach for common names to ensure 100% accuracy, and a rule-based engine for unique names.
am: ይህ መተግበሪያ ስሞችን ከአፋን ኦሮሞ (ቁቤ)፣ እንግሊዝኛ እና አማርኛ (ፊደል) በትክክለኛነት ለመለወጥ ያረጋል። ለሰላሳ ስሞች የመጀመሪያ የመረጃ ቋት ተጠቃሚ ነው እና ለእንግዳ ስሞች የሥርዓተ ህግ ሞተር ያስተናግዳል።

# developedBy
source: Developed by: Galgalo Doyo Adi galgaloda@gmail.com
am: የተሰራ በ: ገለገሎ ዶዮ አዲ galgaloda@gmail.com

# version
source: Version 1.9.0
am: ስሪት 1.9.0

# sendFeedbackButton
source: Send Feedback
am: አስተያየት ያስተላልፉ

source: Share App
am: መተግበሪያ ያካፍሉ

source: Dark Mode
am: ጨለማ ሁነታ

source: Language
am: ቋንቋ

source: Select Language
am: ቋንቋ ይምረጡ
